MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1904/mcu.h
extern volatile SPBRGLbits_t SPBRGLbits __at(0x19B);
// bitfield macros
#define _SPBRGL_SPBRGL_POSN                                 0x0
#define _SPBRGL_SPBRGL_POSITION                             0x0
#define _SPBRGL_SPBRGL_SIZE                                 0x8
#define _SPBRGL_SPBRGL_LENGTH                               0x8
#define _SPBRGL_SPBRGL_MASK                                 0xFF
#define _SPBRGL_BRG0_POSN                                   0x0
#define _SPBRGL_BRG0_POSITION                               0x0
#define _SPBRGL_BRG0_SIZE                                   0x1
#define _SPBRGL_BRG0_LENGTH                                 0x1
#define _SPBRGL_BRG0_MASK                                   0x1
#define _SPBRGL_BRG1_POSN                                   0x1
#define _SPBRGL_BRG1_POSITION                               0x1
#define _SPBRGL_BRG1_SIZE                                   0x1
#define _SPBRGL_BRG1_LENGTH                                 0x1
#define _SPBRGL_BRG1_MASK                                   0x2
#define _SPBRGL_BRG2_POSN                                   0x2
#define _SPBRGL_BRG2_POSITION                               0x2
#define _SPBRGL_BRG2_SIZE                                   0x1
#define _SPBRGL_BRG2_LENGTH                                 0x1
#define _SPBRGL_BRG2_MASK                                   0x4
#define _SPBRGL_BRG3_POSN                                   0x3
#define _SPBRGL_BRG3_POSITION                               0x3
#define _SPBRGL_BRG3_SIZE                                   0x1
#define _SPBRGL_BRG3_LENGTH                                 0x1
#define _SPBRGL_BRG3_MASK                                   0x8
#define _SPBRGL_BRG4_POSN                                   0x4
#define _SPBRGL_BRG4_POSITION                               0x4
#define _SPBRGL_BRG4_SIZE                                   0x1
#define _SPBRGL_BRG4_LENGTH                                 0x1
#define _SPBRGL_BRG4_MASK                                   0x10
#define _SPBRGL_BRG5_POSN                                   0x5
#define _SPBRGL_BRG5_POSITION                               0x5
#define _SPBRGL_BRG5_SIZE                                   0x1
#define _SPBRGL_BRG5_LENGTH                                 0x1
#define _SPBRGL_BRG5_MASK                                   0x20
#define _SPBRGL_BRG6_POSN                                   0x6
#define _SPBRGL_BRG6_POSITION                               0x6
#define _SPBRGL_BRG6_SIZE                                   0x1
#define _SPBRGL_BRG6_LENGTH                                 0x1
#define _SPBRGL_BRG6_MASK                                   0x40
#define _SPBRGL_BRG7_POSN                                   0x7
#define _SPBRGL_BRG7_POSITION                               0x7
#define _SPBRGL_BRG7_SIZE                                   0x1
#define _SPBRGL_BRG7_LENGTH                                 0x1
#define _SPBRGL_BRG7_MASK                                   0x80

// Register: SP1BRGH
#define SP1BRGH SP1BRGH
extern volatile unsigned char           SP1BRGH             __at(0x19C);
#ifndef _LIB_BUILD
asm("SP1BRGH equ 019Ch");
#endif
// aliases
extern volatile unsigned char           SPBRGH              __at(0x19C);
#ifndef _LIB_BUILD
asm("SPBRGH equ 019Ch");
#endif
extern volatile unsigned char           SPBRGH1             __at(0x19C);
#ifndef _LIB_BUILD
asm("SPBRGH1 equ 019Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRGH                 :8;
    };
    struct {
        unsigned BRG8                   :1;
        unsigned BRG9                   :1;
        unsigned BRG10                  :1;
        unsigned BRG11                  :1;
        unsigned BRG12                  :1;
        unsigned BRG13                  :1;
        unsigned BRG14                  :1;
        unsigned BRG15                  :1;
    };
} SP1BRGHbits_t;
extern volatile SP1BRGHbits_t SP1BRGHbits __at(0x19C);
// bitfield macros
#define _SP1BRGH_SPBRGH_POSN                                0x0
#define _SP1BRGH_SPBRGH_POSITION                            0x0
#define _SP1BRGH_SPBRGH_SIZE                                0x8
#define _SP1BRGH_SPBRGH_LENGTH                              0x8
#define _SP1BRGH_SPBRGH_MASK                                0xFF
#define _SP1BRGH_BRG8_POSN                                  0x0
#define _SP1BRGH_BRG8_POSITION                              0x0
#define _SP1BRGH_BRG8_SIZE                                  0x1
#define _SP1BRGH_BRG8_LENGTH                                0x1
#define _SP1BRGH_BRG8_MASK                                  0x1
#define _SP1BRGH_BRG9_POSN                                  0x1
#define _SP1BRGH_BRG9_POSITION                              0x1
#define _SP1BRGH_BRG9_SIZE                                  0x1
#define _SP1BRGH_BRG9_LENGTH                                0x1
#define _SP1BRGH_BRG9_MASK                                  0x2
#define _SP1BRGH_BRG10_POSN                                 0x2
#define _SP1BRGH_BRG10_POSITION                             0x2
#define _SP1BRGH_BRG10_SIZE                                 0x1
#define _SP1BRGH_BRG10_LENGTH                               0x1
#define _SP1BRGH_BRG10_MASK                                 0x4
#define _SP1BRGH_BRG11_POSN                                 0x3
#define _SP1BRGH_BRG11_POSITION                             0x3
#define _SP1BRGH_BRG11_SIZE                                 0x1
#define _SP1BRGH_BRG11_LENGTH                               0x1
#define _SP1BRGH_BRG11_MASK                                 0x8
#define _SP1BRGH_BRG12_POSN                                 0x4
#define _SP1BRGH_BRG12_POSITION                             0x4
#define _SP1BRGH_BRG12_SIZE                                 0x1
#define _SP1BRGH_BRG12_LENGTH                               0x1
#define _SP1BRGH_BRG12_MASK                                 0x10
#define _SP1BRGH_BRG13_POSN                                 0x5
#define _SP1BRGH_BRG13_POSITION                             0x5
#define _SP1BRGH_BRG13_SIZE                                 0x1
#define _SP1BRGH_BRG13_LENGTH                               0x1
#define _SP1BRGH_BRG13_MASK                                 0x20
#define _SP1BRGH_BRG14_POSN                                 0x6
#define _SP1BRGH_BRG14_POSITION                             0x6
#define _SP1BRGH_BRG14_SIZE                                 0x1
#define _SP1BRGH_BRG14_LENGTH                               0x1
#define _SP1BRGH_BRG14_MASK                                 0x40
#define _SP1BRGH_BRG15_POSN                                 0x7
#define _SP1BRGH_BRG15_POSITION                             0x7
#define _SP1BRGH_BRG15_SIZE                                 0x1
#define _SP1BRGH_BRG15_LENGTH                               0x1
#define _SP1BRGH_BRG15_MASK                                 0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned SPBRGH                 :8;
    };
    struct {
        unsigned BRG8                   :1;
        unsigned BRG9                   :1;
        unsigned BRG10                  :1;
        unsigned BRG11                  :1;
        unsigned BRG12                  :1;
        unsigned BRG13                  :1;
        unsigned BRG14                  :1;
        unsigned BRG15                  :1;
    };
} SPBRGHbits_t;
extern volatile SPBRGHbits_t SPBRGHbits __at(0x19C);
// bitfield macros
#define _SPBRGH_SPBRGH_POSN                                 0x0
#define _SPBRGH_SPBRGH_POSITION                             0x0
#define _SPBRGH_SPBRGH_SIZE                                 0x8
#define _SPBRGH_SPBRGH_LENGTH                               0x8
#define _SPBRGH_SPBRGH_MASK                                 0xFF
#define _SPBRGH_BRG8_POSN                                   0x0
#define _SPBRGH_BRG8_POSITION                               0x0
#define _SPBRGH_BRG8_SIZE                                   0x1
#define _SPBRGH_BRG8_LENGTH                                 0x1
#define _SPBRGH_BRG8_MASK                                   0x1
#define _SPBRGH_BRG9_POSN                                   0x1
#define _SPBRGH_BRG9_POSITION                               0x1
#define _SPBRGH_BRG9_SIZE                                   0x1
#define _SPBRGH_BRG9_LENGTH                                 0x1
#define _SPBRGH_BRG9_MASK                                   0x2
#define _SPBRGH_BRG10_POSN                                  0x2
#define _SPBRGH_BRG10_POSITION                              0x2
#define _SPBRGH_BRG10_SIZE                                  0x1
#define _SPBRGH_BRG10_LENGTH                                0x1
#define _SPBRGH_BRG10_MASK                                  0x4
#define _SPBRGH_BRG11_POSN                                  0x3
#define _SPBRGH_BRG11_POSITION                              0x3
#define _SPBRGH_BRG11_SIZE                                  0x1
#define _SPBRGH_BRG11_LENGTH                                0x1
#define _SPBRGH_BRG11_MASK                                  0x8
#define _SPBRGH_BRG12_POSN                                  0x4
#define _SPBRGH_BRG12_POSITION                              0x4
#define _SPBRGH_BRG12_SIZE                                  0x1
#define _SPBRGH_BRG12_LENGTH                                0x1
#define _SPBRGH_BRG12_MASK                                  0x10
#define _SPBRGH_BRG13_POSN                                  0x5
#define _SPBRGH_BRG13_POSITION                              0x5
#define _SPBRGH_BRG13_SIZE                                  0x1
#define _SPBRGH_BRG13_LENGTH                                0x1
#define _SPBRGH_BRG13_MASK                                  0x20
#define _SPBRGH_BRG14_POSN                                  0x6
#define _SPBRGH_BRG14_POSITION                              0x6
#define _SPBRGH_BRG14_SIZE                                  0x1
#define _SPBRGH_BRG14_LENGTH                                0x1
#define _SPBRGH_BRG14_MASK                                  0x40
#define _SPBRGH_BRG15_POSN                                  0x7
#define _SPBRGH_BRG15_POSITION                              0x7
#define _SPBRGH_BRG15_SIZE                                  0x1
#define _SPBRGH_BRG15_LENGTH                                0x1
#define _SPBRGH_BRG15_MASK                                  0x80
typedef union {
    struct {
        unsigned SPBRGH                 :8;
    };
    struct {
        unsigned BRG8                   :1;
        unsigned BRG9                   :1;
        unsigned BRG10                  :1;
        unsigned BRG11                  :1;
        unsigned BRG12                  :1;
        unsigned BRG13                  :1;
        unsigned BRG14                  :1;
        unsigned BRG15                  :1;
    };
} SPBRGH1bits_t;
extern volatile SPBRGH1bits_t SPBRGH1bits __at(0x19C);
// bitfield macros
#define _SPBRGH1_SPBRGH_POSN                                0x0
#define _SPBRGH1_SPBRGH_POSITION                            0x0
#define _SPBRGH1_SPBRGH_SIZE                                0x8
#define _SPBRGH1_SPBRGH_LENGTH                              0x8
#define _SPBRGH1_SPBRGH_MASK                                0xFF
#define _SPBRGH1_BRG8_POSN                                  0x0
#define _SPBRGH1_BRG8_POSITION                              0x0
#define _SPBRGH1_BRG8_SIZE                                  0x1
#define _SPBRGH1_BRG8_LENGTH                                0x1
#define _SPBRGH1_BRG8_MASK                                  0x1
#define _SPBRGH1_BRG9_POSN                                  0x1
#define _SPBRGH1_BRG9_POSITION                              0x1
#define _SPBRGH1_BRG9_SIZE                                  0x1
#define _SPBRGH1_BRG9_LENGTH                                0x1
#define _SPBRGH1_BRG9_MASK                                  0x2
#define _SPBRGH1_BRG10_POSN                                 0x2
#define _SPBRGH1_BRG10_POSITION                             0x2
#define _SPBRGH1_BRG10_SIZE                                 0x1
#define _SPBRGH1_BRG10_LENGTH                               0x1
#define _SPBRGH1_BRG10_MASK                                 0x4
#define _SPBRGH1_BRG11_POSN                                 0x3
#define _SPBRGH1_BRG11_POSITION                             0x3
#define _SPBRGH1_BRG11_SIZE                                 0x1
#define _SPBRGH1_BRG11_LENGTH                               0x1
#define _SPBRGH1_BRG11_MASK                                 0x8
#define _SPBRGH1_BRG12_POSN                                 0x4
#define _SPBRGH1_BRG12_POSITION                             0x4
#define _SPBRGH1_BRG12_SIZE                                 0x1
#define _SPBRGH1_BRG12_LENGTH                               0x1
#define _SPBRGH1_BRG12_MASK                                 0x10
#define _SPBRGH1_BRG13_POSN                                 0x5
#define _SPBRGH1_BRG13_POSITION                             0x5
#define _SPBRGH1_BRG13_SIZE                                 0x1
#define _SPBRGH1_BRG13_LENGTH                               0x1
#define _SPBRGH1_BRG13_MASK                                 0x20
#define _SPBRGH1_BRG14_POSN                                 0x6
#define _SPBRGH1_BRG14_POSITION                             0x6
#define _SPBRGH1_BRG14_SIZE                                 0x1
#define _SPBRGH1_BRG14_LENGTH                               0x1
#define _SPBRGH1_BRG14_MASK                                 0x40
#define _SPBRGH1_BRG15_POSN                                 0x7
#define _SPBRGH1_BRG15_POSITION                             0x7
#define _SPBRGH1_BRG15_SIZE                                 0x1
#define _SPBRGH1_BRG15_LENGTH                               0x1
#define _SPBRGH1_BRG15_MASK                                 0x80

// Register: RC1STA
#define RC1STA RC1STA
extern volatile unsigned char           RC1STA              __at(0x19D);
#ifndef _LIB_BUILD
asm("RC1STA equ 019Dh");
#endif
// aliases
extern volatile unsigned char           RCSTA               __at(0x19D);
#ifndef _LIB_BUILD
asm("RCSTA equ 019Dh");
#endif
extern volatile unsigned char           RCSTA1              __at(0x19D);
#ifndef _LIB_BUILD
asm("RCSTA1 equ 019Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
} RC1STAbits_t;
extern volatile RC1STAbits_t RC1STAbits __at(0x19D);
// bitfield macros
#define _RC1STA_RX9D_POSN                                   0x0
#define _RC1STA_RX9D_POSITION                               0x0
#define _RC1STA_RX9D_SIZE                                   0x1
#define _RC1STA_RX9D_LENGTH                                 0x1
#define _RC1STA_RX9D_MASK                                   0x1
#define _RC1STA_OERR_POSN                                   0x1
#define _RC1STA_OERR_POSITION                               0x1
#define _RC1STA_OERR_SIZE                                   0x1
#define _RC1STA_OERR_LENGTH                                 0x1
#define _RC1STA_OERR_MASK                                   0x2
#define _RC1STA_FERR_POSN                                   0x2
#define _RC1STA_FERR_POSITION                               0x2
#define _RC1STA_FERR_SIZE                                   0x1
#define _RC1STA_FERR_LENGTH                                 0x1
#define _RC1STA_FERR_MASK                                   0x4
#define _RC1STA_ADDEN_POSN                                  0x3
#define _RC1STA_ADDEN_POSITION                              0x3
#define _RC1STA_ADDEN_SIZE                                  0x1
#define _RC1STA_ADDEN_LENGTH                                0x1
#define _RC1STA_ADDEN_MASK                                  0x8
#define _RC1STA_CREN_POSN                                   0x4
#define _RC1STA_CREN_POSITION                               0x4
#define _RC1STA_CREN_SIZE                                   0x1
#define _RC1STA_CREN_LENGTH                                 0x1
#define _RC1STA_CREN_MASK                                   0x10
#define _RC1STA_SREN_POSN                                   0x5
#define _RC1STA_SREN_POSITION                               0x5
#define _RC1STA_SREN_SIZE                                   0x1
#define _RC1STA_SREN_LENGTH                                 0x1
#define _RC1STA_SREN_MASK                                   0x20
#define _RC1STA_RX9_POSN                                    0x6
#define _RC1STA_RX9_POSITION                                0x6
#define _RC1STA_RX9_SIZE                                    0x1
#define _RC1STA_RX9_LENGTH                                  0x1
#define _RC1STA_RX9_MASK                                    0x40
#define _RC1STA_SPEN_POSN                                   0x7
#define _RC1STA_SPEN_POSITION                               0x7
#define _RC1STA_SPEN_SIZE                                   0x1
#define _RC1STA_SPEN_LENGTH                                 0x1
#define _RC1STA_SPEN_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
} RCSTAbits_t;
